Test

```

stdout<<ghadelimiter_299f7a57-4539-4e98-b443-7619083d119d

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

ghadelimiter_299f7a57-4539-4e98-b443-7619083d119d
stderr<<ghadelimiter_c01af371-4c05-48bb-bb6f-1775771b4581

ghadelimiter_c01af371-4c05-48bb-bb6f-1775771b4581
exitcode<<ghadelimiter_4e1d1069-c412-4522-a6be-0c727b14d458
0
ghadelimiter_4e1d1069-c412-4522-a6be-0c727b14d458
Plan: 1 to add, 0 to change, 0 to destroy.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
```
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Security 🛡️ `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/689094a5-e82c-430e-94a8-25e293ebf08b/terraform-bin plan -no-color -out tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_11c960a2-e03e-4f1f-a928-959e2df87d9e

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_11c960a2-e03e-4f1f-a928-959e2df87d9e
stderr<<ghadelimiter_5804a20c-8ba8-4fa7-9f04-18736117f66c

ghadelimiter_5804a20c-8ba8-4fa7-9f04-18736117f66c
exitcode<<ghadelimiter_28a2bb37-8372-459e-a049-7723b28c4e93
0
ghadelimiter_28a2bb37-8372-459e-a049-7723b28c4e93
```
</details>

*Pusher: @dawidmalina, Action: `pull_request`, Working Directory: `gcp/prod/global`, Workflow: `Terraform`*